In [1]:
import pandas as pd

df = pd.DataFrame({'minutes': [30, 35, 40],
                  'points': [13, 21, 50],
                  'team': ['knicks', 'lakers', 'knicks']},
                 index = ['drose', 'lebron', 'kemba'])

In [2]:
df

        minutes  points    team
drose        30      13  knicks
lebron       35      21  lakers
kemba        40      50  knicks

In [3]:
# Passing a list of values

# The DataFrame `df` has a method `.isin(values)` that will return a boolean based on the *values* argument 
# which should be an iterable (lists, tuples, sets, series, dict).  
df.isin([30, 21])

        minutes  points   team
drose      True   False  False
lebron    False    True  False
kemba     False   False  False

In [4]:
df[df.isin([30, 21])]

        minutes  points team
drose      30.0     NaN  NaN
lebron      NaN    21.0  NaN
kemba       NaN     NaN  NaN

In [5]:
# Passing a dictionary of values

values = {'points': [13], 'minutes': [13]}
df.isin(values)

        minutes  points   team
drose     False    True  False
lebron    False   False  False
kemba     False   False  False

In [6]:
# Using the `.query()` 
# The `query()` method is used on a DataFrame to query its columns. This method returns a  boolean expression.

df.query('points > 20')

        minutes  points    team
lebron       35      21  lakers
kemba        40      50  knicks

In [7]:
# Passing multiple conditions to the `.query()` method.

df.query('points > 20 and minutes < 50')

        minutes  points    team
lebron       35      21  lakers
kemba        40      50  knicks

In [8]:
# # Using a string method to query

# To use object methods from the base python installations, use the name of the column, 
# followed by the appropriate datatype constructor and subsequent method.

# When using a Python method, the `engine` argument must be specified.The code below shows 
# how to select teams that contain the letter `k`:

df.query('team.str.contains("k")', engine = "python")

        minutes  points    team
drose        30      13  knicks
lebron       35      21  lakers
kemba        40      50  knicks